БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПорядокОтраженияЗатрат(ПорядокОтраженияДоходов) Экспорт
	
	Если ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление;
	ИначеЕсли ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам  Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам ;
	ИначеЕсли  ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.Затраты ;
	КонецЕсли;
	
	Возврат Перечисления.CW_ПорядокОтраженияЗатрат.ПустаяСсылка()
	
КонецФункции

#КонецЕсли
